---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersect
source: html/9d492bf7-0105-bb2a-5d3d-652130b2be35.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersect Property

Lines cannot intersect each other. The highlighted lines currently intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopIntersect { get; }
```